In [1]:
"""
Q1. List any five functions of the pandas library with execution.
"""

'\nQ1. List any five functions of the pandas library with execution.\n'

In [1]:
import pandas as pd

In [3]:
d = {'Name': ["Alice", "Bob", "Claire","Ali", "Poc", "John"], 'Age': [25, 30, 27, 23,45,36], 'Gender': ["Female", "Male", "Female", "Female", "Male", "Female"]}
df = pd.DataFrame(data=d)

In [4]:
df.head(3)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [5]:
df.tail(3)

   Name  Age  Gender
3   Ali   23  Female
4   Poc   45    Male
5  John   36  Female

In [6]:
df.dtypes

Name      object
Age        int64
Gender    object
dtype: object

In [7]:
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [8]:
df['Age']

0    25
1    30
2    27
3    23
4    45
5    36
Name: Age, dtype: int64

In [9]:
df[['Age', 'Gender']]

   Age  Gender
0   25  Female
1   30    Male
2   27  Female
3   23  Female
4   45    Male
5   36  Female

In [10]:
"""
Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.
"""

"\nQ2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the\nDataFrame with a new index that starts from 1 and increments by 2 for each row.\n"

In [11]:
d = {'A': ["Alice", "Bob", "Claire","Ali", "Poc", "John"], 'B': [25, 30, 27, 23,45,36], 'C': ["Female", "Male", "Female", "Female", "Male", "Female"]}
df = pd.DataFrame(data=d)

In [12]:
l = list(range(1,len(df)))
def lis_inc(l):
    for i,j in enumerate(l):
        if i > 0:
            l[i] = l[i-1]+2

lis_inc(l)
df.reindex(l, columns=['A', 'B', 'C'])

      A     B       C
1   Bob  30.0    Male
3   Ali  23.0  Female
5  John  36.0  Female
7   NaN   NaN     NaN
9   NaN   NaN     NaN

In [13]:
"""
Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.
"""

"\nQ3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that\niterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The\nfunction should print the sum to the console.\nFor example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should\ncalculate and print the sum of the first three values, which is 60.\n"

In [14]:
df = pd.DataFrame([10, 20, 30, 40, 50])

In [22]:
df.loc[0:2].sum()

0    60
dtype: int64

In [23]:
"""
Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.
"""

"\nQ4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column\n'Word_Count' that contains the number of words in each row of the 'Text' column.\n"

In [26]:
d = {'Text': ["This is Python", "Dataframe class", "Dataframe class in Data science"]}
df = pd.DataFrame(data=d)

In [28]:
df['word_count'] = df['Text'].apply(lambda x: len(x.split()))

In [29]:
df

                              Text  word_count
0                   This is Python           3
1                  Dataframe class           2
2  Dataframe class in Data science           5

In [32]:
"""
Q5. How are DataFrame.size() and DataFrame.shape() different?
"""
"""
Size of a dataframe is the number of fields in the dataframe which is nothing but number of rows * number of columns. 
Shape of a dataframe gets the number of rows and number of columns of the dataframe.
"""

'\nQ5. How are DataFrame.size() and DataFrame.shape() different?\n'

In [33]:
df.size

6

In [34]:
df.shape

(3, 2)

In [36]:
"""
Q6. Which function of pandas do we use to read an excel file?
"""
"""
pd.read_excel("File path/filename.xlsx")
"""

'\npd.read_excel("File path/filename.xlsx")\n'

In [37]:
"""
Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.
"""

"\nQ7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email\naddresses in the format 'username@domain.com'. Write a Python function that creates a new column\n'Username' in df that contains only the username part of each email address.\nThe username is the part of the email address that appears before the '@' symbol. For example, if the\nemail address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your\nfunction should extract the username from each email address and store it in the new 'Username'\ncolumn.\n"

In [38]:
d = {'email': ["py@gmail.com", "df@gmail.com", "ds@gmail.com"]}
df = pd.DataFrame(data=d)

In [44]:
df['username'] = df['email'].apply(lambda x: x.split('@')[0])

In [45]:
df

          email username
0  py@gmail.com       py
1  df@gmail.com       df
2  ds@gmail.com       ds

In [46]:
"""
Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
"""

"\nQ8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects\nall rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The\nfunction should return a new DataFrame that contains only the selected rows.\n"

In [47]:
d = {'A': [3,8,6,2,9,8,9], "B": [5,2,9,3,1,2,1], "C": [1,7,4,5,2,7,2]}
df = pd.DataFrame(data=d)

In [59]:
cond_sel = df[(df["A"] > 5) & (df["B"] < 5)]

In [60]:
cond_sel.head()

   A  B  C
1  8  2  7
4  9  1  2
5  8  2  7
6  9  1  2

In [62]:
"""
Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.
"""

"\nQ9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,\nmedian, and standard deviation of the values in the 'Values' column.\n"

In [64]:
d1 = {'A': [3,8,6,2,9,8,9], "B": [5,2,9,3,1,2,1], "C": [1,7,4,5,2,7,2]}
df = pd.DataFrame(data=d1)

In [65]:
df["A"].mean()

6.428571428571429

In [67]:
df["A"].median()

8.0

In [68]:
df["A"]. std()

2.878491668515698

In [69]:
"""
Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.
"""

"\nQ10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to\ncreate a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days\nfor each row in the DataFrame. The moving average should be calculated using a window of size 7 and\nshould include the current day.\n"

In [73]:
sales = [62, 64, 63, 69, 71, 73, 74, 76, 75, 74, 72, 86, 98, 85, 
          103, 92, 93, 96, 96, 75, 84, 91, 71, 108, 106, 106, 115, 116, 122, 
          108, 101, 125, 119, 107, 123, 109, 163, 149, 99, 137, 110, 187, 116, 
          123, 144, 119, 176, 155, 179, 179, 123, 133, 200, 193, 136, 167, 131, 179, 
          200, 192, 138, 164, 210, 174, 257, 180, 173, 221, 204, 187, 283, 198, 223, 218, 198, 
          168, 279, 187, 261, 210, 221, 201, 257, 160, 312, 169, 239, 277, 148, 236, 255]

dates = pd.date_range('2023-04-01', periods=len(sales))
df = pd.DataFrame(data=zip(dates, sales), columns=['Date', 'Sales'])
print(df.head())

        Date  Sales
0 2023-04-01     62
1 2023-04-02     64
2 2023-04-03     63
3 2023-04-04     69
4 2023-04-05     71

In [74]:
df['Rolling'] = df['Sales'].rolling(7).mean()

In [76]:
df.head(10)

        Date  Sales    Rolling
0 2023-04-01     62        NaN
1 2023-04-02     64        NaN
2 2023-04-03     63        NaN
3 2023-04-04     69        NaN
4 2023-04-05     71        NaN
5 2023-04-06     73        NaN
6 2023-04-07     74  68.000000
7 2023-04-08     76  70.000000
8 2023-04-09     75  71.571429
9 2023-04-10     74  73.142857

In [2]:
"""
Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
"""

"\nQ11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new\ncolumn 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.\nMonday, Tuesday) corresponding to each date in the 'Date' column.\n"

In [3]:
d = {"Date": ['2023-01-01', '2023-01-02','2023-01-03','2023-01-04','2023-01-05']}
df = pd.DataFrame(data=d)

In [15]:
df['Weekday_name'] = pd.to_datetime(df['Date']).dt.day_name()

In [16]:
df

         Date Weekday_name
0  2023-01-01       Sunday
1  2023-01-02       Monday
2  2023-01-03      Tuesday
3  2023-01-04    Wednesday
4  2023-01-05     Thursday

In [17]:
"""
Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.
"""

"\nQ12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python\nfunction to select all rows where the date is between '2023-01-01' and '2023-01-31'.\n"

In [19]:
d = {"Date": ['2023-01-01', '2023-01-02','2023-01-10','2023-02-04','2023-01-25', '2023-02-17']}
df = pd.DataFrame(data=d)
df['con_date'] = pd.to_datetime(df['Date'], format='%Y-%m-%d')
  
# Filter data between two dates
filtered_df = df.loc[(df['con_date'] >= '2023-01-01')
                     & (df['con_date'] < '2023-01-31')]
# Display
filtered_df

         Date   con_date
0  2023-01-01 2023-01-01
1  2023-01-02 2023-01-02
2  2023-01-10 2023-01-10
4  2023-01-25 2023-01-25

In [20]:
"""
Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?
"""

"""
impoer pandas
"""

'\nimpoer pandas\n'